# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

Expected output:

>
>|    |   InvoiceNo |   StockCode |   year |   month |   day |   hour | Description                     |   Quantity | InvoiceDate         |   UnitPrice |   CustomerID | Country        |   amount_spent |
|---:|------------:|------------:|-------:|--------:|------:|-------:|:--------------------------------|-----------:|:--------------------|------------:|-------------:|:---------------|---------------:|
|  0 |      546084 |       22741 |   2011 |       3 |     3 |     11 | funky diva pen                  |         48 | 2011-03-09 11:28:00 |        0.85 |        14112 | United Kingdom |          40.8  |
|  1 |      545906 |       22557 |   2011 |       3 |     2 |      9 | plasters in tin vintage paisley |         12 | 2011-03-08 09:23:00 |        1.65 |        15764 | United Kingdom |          19.8  |
|  2 |      539475 |       22176 |   2010 |      12 |     7 |     14 | blue owl soft toy               |          1 | 2010-12-19 14:41:00 |        2.95 |        16686 | United Kingdom |           2.95 |
|  3 |      572562 |       21889 |   2011 |      10 |     2 |      9 | wooden box of dominoes          |         12 | 2011-10-25 09:07:00 |        1.25 |        13481 | United Kingdom |          15    |
|  4 |      549372 |       72741 |   2011 |       4 |     5 |     11 | grand chocolatecandle           |          9 | 2011-04-08 11:28:00 |        1.45 |        14958 | United Kingdom |          13.05 |

In [3]:
# your code here
orders = pd.read_csv('../data/orders_sample.csv')
orders.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,546084,22741,2011,3,3,11,funky diva pen,48,2011-03-09 11:28:00,0.85,14112,United Kingdom,40.80
1,545906,22557,2011,3,2,9,plasters in tin vintage paisley,12,2011-03-08 09:23:00,1.65,15764,United Kingdom,19.80
2,539475,22176,2010,12,7,14,blue owl soft toy,1,2010-12-19 14:41:00,2.95,16686,United Kingdom,2.95
3,572562,21889,2011,10,2,9,wooden box of dominoes,12,2011-10-25 09:07:00,1.25,13481,United Kingdom,15.00
4,549372,72741,2011,4,5,11,grand chocolatecandle,9,2011-04-08 11:28:00,1.45,14958,United Kingdom,13.05

In [14]:
orders.describe()

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000,20000.000000
mean,560666.072000,2010.932950,7.640400,3.642250,12.710600,12.602900,2.986745,15277.991450,21.819121
std,13133.570887,0.250115,3.411579,1.926045,2.263693,42.680081,5.818156,1719.752345,76.324074
min,536367.000000,2010.000000,1.000000,1.000000,7.000000,1.000000,0.040000,12347.000000,0.190000
25%,549257.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13883.000000,4.950000
50%,561926.000000,2011.000000,9.000000,4.000000,13.000000,6.000000,1.950000,15144.000000,11.900000
75%,572213.250000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16790.000000,19.800000
max,581587.000000,2011.000000,12.000000,7.000000,20.000000,2880.000000,549.340000,18287.000000,4401.000000

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [55]:
# your code here
grouped_df = orders.groupby(by='CustomerID').agg(total_spent = ('amount_spent', 'sum')).sort_values(by='total_spent', ascending=False)

orders_q75 = grouped_df['total_spent'].quantile(.75)
orders_q95 = grouped_df['total_spent'].quantile(.95)

grouped_df['status'] = np.where(grouped_df['total_spent'] > orders_q95, 'VIP',
                               np.where(grouped_df['total_spent'] > orders_q75, 'Preferred',
                               'Regular'))

grouped_df

            total_spent   status
CustomerID
14646          12518.46      VIP
18102          12167.41      VIP
17450          11000.00      VIP
14156           9042.19      VIP
12415           8844.52      VIP
...                 ...      ...
12977              0.65  Regular
15578              0.55  Regular
15853              0.55  Regular
12573              0.42  Regular
15863              0.39  Regular

[3326 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [56]:
# your code here

vip_countries = pd.merge(left = orders['Country'], right = 
                         grouped_df['status'], left_index=True, right_index=True)

vip_countries[vip_countries['status'] == 'VIP'].groupby(
    by='Country').count().sort_values(by='status', ascending=False).head(1)

                status
Country
United Kingdom     139

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [59]:
# your code here

vip_countries[vip_countries['status'] != 'Regular'].groupby(
    by='Country').count().sort_values(by='status', ascending=False).head(1)

                status
Country
United Kingdom     733